IDEA Open Model
LineSupportSegment.SupportTypeX Property
Compatible with IDEA StatiCa v 10.1
 Support type in dirrection X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public SupportTypeInDirrection SupportTypeX { get; set; }
Public Property SupportTypeX As SupportTypeInDirrection
	Get
	Set
public:
property SupportTypeInDirrection SupportTypeX {
	SupportTypeInDirrection get ();
	void set (SupportTypeInDirrection value);
}
Property Value
Type: SupportTypeInDirrection
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace